//
// Created by ybkuanysh on 2025/10/03.
//

/**
 * @brief <b>7.2 Базовый уровень</b>\n
 * Задание: Написать программу согласно заданию\n
 * Вариант 14: В заданной строке посчитать количество точек и запятых
 */
void glazunova_7_2_basic() {}

/**
 * @brief <b>7.2 Средний уровень</b>\n
 * Задание: написать программу согласно заданию\n
 * Вариант 14: В заданной строке удалить первый символ «», который найдется в строке
 */
void glazunova_7_2_middle() {}

/**
 * @brief <b>7.2 Высокий уровень</b>\n
 * Задание: написать программу согласно заданию\n
 * Вариант 4: В заданной строке заменить каждый символ «*» числом,\n
 * соответствующим номеру по порядку вхождения этого символа в строку
 */
void glazunova_7_2_high() {}

int main() {
    return 0;
}